Revit 2024 API
BuiltInFailures.OpeningFailures.OpenStringerConflictNosing Property
 Open stringer can't be created for selected nosing profile. Set nosing profile to default to get open stringers created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OpenStringerConflictNosing { get; }
Visual Basic
Public Shared ReadOnly Property OpenStringerConflictNosing As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OpenStringerConflictNosing {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace